src/config/AccumulationRegisters/ВзаиморасчетыСПодотчетнымиЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПодотчетнымиЛицами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/УчетДенежныхСредствВПодотчетеУВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>УчетДенежныхСредствВПодотчетеУВодителей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаТранспорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПредыдущийДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыДополнительныхВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеТабличныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлгоритмЦенообразования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Comment>Внешние  обработки, печатные формы, обработки по заполнению табличных частей</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКФайлуИсточнику</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТестировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДляОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьФиксироватьВремяЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенДляВсехПользователейЯрославля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/CommonModules/яштПодотчетники/Ext/Module.bsl
Процедура СоздатьЗаданияПодотчетникам() Экспорт
	ДатаПодотчетов = ТекущаяДата() + 60*60*24;
	ДокументыКОплате = НайтиПодотчетыНаДату(ДатаПодотчетов);
	
	Для каждого стр из ДокументыКОплате Цикл
		//Задача Подотчетнику
		Если ЗначениеЗаполнено(стр.ПодотчетникПользователь) Тогда
	    НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	    НоваяЗадача.Исполнитель  = стр.ПодотчетникПользователь;
	    НоваяЗадача.Наименование = "Напоминание о необходимости предоставления отчета об использовании денежных средств";
	    НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.ДатаИсполнения = стр.ДатаПогашенияАванса;
	    НоваяЗадача.Оповещение   = Истина;
	    НоваяЗадача.СрокОповещения = ТекущаяДата()+60;
		НоваяЗадача.Описание = "Необходимо предоставить в бухгалтерию отчет 
		| об использовании наличных денежных средств, 
		| выданных "+ Формат(стр.ДатаПолученияАванса,"ДФ=dd.MM.yyyy") +" в размере "+стр.Сумма+" руб. 
		| по заявке на расходование "+Строка(стр.Заявка)+".
        | Срок предоставления отчета - "+Формат(стр.ДатаПогашенияАванса,"ДФ=dd.MM.yyyy");
		НоваяЗадача.Записать();
		КонецЕсли;
		//Задача кассиру
		НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	    НоваяЗадача.Исполнитель  = стр.Кассир;
		НоваяЗадача.Объект = стр.Документ;
	    НоваяЗадача.Наименование = "Напоминание о необходимости предоставления отчета об использовании денежных средств";
	    НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.ДатаИсполнения = стр.ДатаПогашенияАванса;
	    НоваяЗадача.Оповещение   = Истина;
	    НоваяЗадача.СрокОповещения = ТекущаяДата()+60;
		НоваяЗадача.Описание = "Сотруднику "+Строка(стр.ПодотчетникФизЛицо) +" необходимо предоставить в бухгалтерию отчет 
		| об использовании наличных денежных средств, 
		| выданных "+ Формат(стр.ДатаПолученияАванса,"ДФ=dd.MM.yyyy") +" в размере "+стр.Сумма +" руб.
		| по заявке на расходование "+Строка(стр.Заявка)+".
        | Срок предоставления отчета - "+Формат(стр.ДатаПогашенияАванса,"ДФ=dd.MM.yyyy");
		НоваяЗадача.Записать();
	КонецЦикла;
КонецПроцедуры
	
Функция НайтиПодотчетыНаДату(ДатаПодотчетов)
	ЗапросПоПодотчетам = Новый Запрос;
	ЗапросПоПодотчетам.УстановитьПараметр("Дата1",НачалоДня(ДатаПодотчетов));
	ЗапросПоПодотчетам.УстановитьПараметр("Дата2",КонецДня(ДатаПодотчетов));
	ЗапросПоПодотчетам.УстановитьПараметр("ТекДата",ТекущаяДата());
	ЗапросПоПодотчетам.УстановитьПараметр("Подотчет",Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику);
	ЗапросПоПодотчетам.Текст = "ВЫБРАТЬ
	                           |	МИНИМУМ(Пользователи.Ссылка) КАК Ссылка,
	                           |	Пользователи.ФизЛицо
	                           |ПОМЕСТИТЬ Пользователи
	                           |ИЗ
	                           |	Справочник.Пользователи КАК Пользователи
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	Пользователи.ФизЛицо
	                           |;
	                           |
	                           |////////////////////////////////////////////////////////////////////////////////
	                           |ВЫБРАТЬ
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Ссылка КАК Документ,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Номер КАК Номер,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Дата КАК ДатаПолученияАванса,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.ДатаПогашенияАванса КАК ДатаПогашенияАванса,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Организация КАК Организация,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Подразделение КАК Подразделение,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Контрагент КАК ПодотчетникФизЛицо,
	                           |	Пользователи.Ссылка КАК ПодотчетникПользователь,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаУпрОстаток КАК Сумма,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.ЗаявкаНаРасходованиеСредств КАК Заявка,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки1.СуммаВзаиморасчетовОстаток КАК ОбщаяСуммаЗадолженности,
	                           |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.Ответственный КАК Кассир
	                           |ИЗ
	                           |	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&ТекДата, РасчетныйДокумент.ДатаПогашенияАванса МЕЖДУ &Дата1 И &Дата2) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&ТекДата, ) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки1
	                           |		ПО ВзаиморасчетыСПодотчетнымиЛицамиОстатки.ФизЛицо = ВзаиморасчетыСПодотчетнымиЛицамиОстатки1.ФизЛицо
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ Пользователи КАК Пользователи
	                           |		ПО ВзаиморасчетыСПодотчетнымиЛицамиОстатки.ФизЛицо = Пользователи.ФизЛицо";
	результат = ЗапросПоПодотчетам.Выполнить().Выгрузить();						   
	Возврат результат;	
КонецФункции

Процедура ПроверитьНаличиеДолгаЗаПодотчетником(ДокументСсылка,Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Подотчетник", ДокументСсылка.Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.ФизЛицо,
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.Валюта,
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент,
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток,
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаУпрОстаток,
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.ДатаПогашенияАванса КАК ДатаПогашенияАванса
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
	               |			&Период,
	               |			ФизЛицо = &Подотчетник
	               |				И РасчетныйДокумент ССЫЛКА Документ.РасходныйКассовыйОрдер) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	               |ГДЕ
	               |	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент.ДатаПогашенияАванса < &Период
	               |	И ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаУпрОстаток > 0";
				   
	Результат = Запрос.Выполнить().Выбрать();			   
	Если Результат.Количество() > 0 Тогда
		Если РольДоступна("яштФинДиректор") Тогда
			Сообщить("Внимание! У подотчетника есть долги");
		Иначе
			Сообщить("Документ не может быть проведен, т.к. у подотчетника есть долги");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл
		Сообщить(Строка(Результат.РасчетныйДокумент) + " срок погашения аванса " + ?(Результат.ДатаПогашенияАванса = Дата(1,1,1), "не заполнен", Строка(Лев(Результат.ДатаПогашенияАванса, 10))) + ", сумма долга " + Строка(Результат.СуммаУпрОстаток) + " руб.");
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДолгиПередПодотчетником(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент КАК Документ,
	|	-ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&Дата, ФизЛицо = &ФизЛицо) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ФизЛицо", ДокументСсылка.Контрагент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


///Плотников 

Процедура ИзвеститьМенеджеровОДолгахВодителей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаС",НачалоДня(ТекущаяДата()-24*60*60*5));
	Запрос.УстановитьПараметр("ДатаПо",КонецДня(ТекущаяДата()-24*60*60*5));
	Запрос.Текст = "ВЫБРАТЬ
	|	УчетДенежныхСредствВПодотчетеУВодителейОстатки.Заказ.ДоговорКонтрагента.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	СУММА(ЕСТЬNULL(УчетДенежныхСредствВПодотчетеУВодителейОстатки.СуммаОстаток, 0) + ЕСТЬNULL(УчетДенежныхСредствВПодотчетеУВодителейОстатки.СуммаТранспортОстаток, 0) + ЕСТЬNULL(УчетДенежныхСредствВПодотчетеУВодителейОстатки.СуммаПредыдущийДолгОстаток, 0)) КАК Сумма,
	|	УчетДенежныхСредствВПодотчетеУВодителейОстатки.Заказ
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	РегистрНакопления.УчетДенежныхСредствВПодотчетеУВодителей.Остатки КАК УчетДенежныхСредствВПодотчетеУВодителейОстатки
	|ГДЕ
	|	УчетДенежныхСредствВПодотчетеУВодителейОстатки.ЗаданиеНаОтгрузку.Дата МЕЖДУ &ДатаС И &ДатаПо
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетДенежныхСредствВПодотчетеУВодителейОстатки.Заказ.ДоговорКонтрагента.ОтветственноеЛицо,
	|	УчетДенежныхСредствВПодотчетеУВодителейОстатки.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	Врем.Заказ,
	|	Врем.Сумма
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Сумма > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтветственноеЛицо";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ПоМенеджерам = Результат.Скопировать();
	ПоМенеджерам.Свернуть("ОтветственноеЛицо");
	
	для Каждого стр из ПоМенеджерам Цикл
		
		отбор = новый Структура;
		отбор.Вставить("ОтветственноеЛицо",стр.ОтветственноеЛицо);
		
		Рез = Результат.Скопировать(Отбор);
		
		Текст = "";
		
		Для каждого стр1 из Рез Цикл
			Текст = Текст + "По заказу " + Строка(стр.Заказ) + " машина была отправлена 5 дней назад,
			|водитель на сегодняшний день не сдал по этому заказу " + стр.Сумма + ";" + Символы.ПС;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(стр.ОтветственноеЛицо) Тогда
			НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
			НоваяЗадача.Исполнитель  = стр.ОтветственноеЛицо;
			НоваяЗадача.Наименование = "Напоминание о необходимости проконтролировать сдачу денег водителем по вашим заказам.";
			НоваяЗадача.Дата = ТекущаяДата();
			НоваяЗадача.ДатаИсполнения = ТекущаяДата();
			НоваяЗадача.Оповещение   = Истина;
			НоваяЗадача.СрокОповещения = ТекущаяДата()+60*60*8;
			НоваяЗадача.Описание = Текст;
			НоваяЗадача.Записать();
		КонецЕсли;
	КонецЦикла;
		
	
	
	
	
	
	
КонецПроцедуры

//14.10.16 Смирнов
Процедура ВыгрузитьДокументыРеализацийНаКолесаТУТ() Экспорт
	ТекСсылка=Справочники.ВнешниеОбработки.НайтиПоНаименованию("Выгрузить реализации на КОЛЕСАТУТ"); 
	ИмяФайла = ПолучитьИмяВременногоФайла(); 
	ДвоичныеДанные = ТекСсылка.ХранилищеВнешнейОбработки.Получить(); 
	ДвоичныеДанные.Записать(ИмяФайла); 
	Если ТекСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда 
		ОбработкаВыгрузитьРеализации = ВнешниеОтчеты.Создать(ИмяФайла,ложь); 
	Иначе 
		ОбработкаВыгрузитьРеализации = ВнешниеОбработки.Создать(ИмяФайла,Ложь); 
	КонецЕсли; 
	ОбработкаВыгрузитьРеализации.ВыгрузитьДокументы(НачалоДня(НачалоДня(ТекущаяДата())-1),КонецДня(ТекущаяДата()));

КонецПроцедуры
